# MultiReferenceAnnotationShowDimensionText Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MultiReferenceAnnotationShowDimensionText Property
ParameterTypeId Class See Also
---
"Show Dimension Text"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MultiReferenceAnnotationShowDimensionText { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MultiReferenceAnnotationShowDimensionText As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MultiReferenceAnnotationShowDimensionText {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace